БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>CW_ПредопреленныеФункцииШаблоновДокументов</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяМетода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторФункции</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДоступныеНазначенияШаблонов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>НазначениеШаблона</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИдентификаторыОбъектовМетаданных</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

БухЭксп/Catalogs/CW_ПредопреленныеФункцииШаблоновДокументов/Ext/ManagerModule.bsl
Процедура ЗаполнитьМетодыПредопределенныхФункций() Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	CW_ПредопреленныеФункцииШаблонов.Ссылка КАК Ссылка,
	               |	CW_ПредопреленныеФункцииШаблонов.ИмяПредопределенныхДанных КАК ИмяПредопределенныхДанных
	               |ИЗ
	               |	Справочник.CW_ПредопреленныеФункцииШаблоновДокументов КАК CW_ПредопреленныеФункцииШаблонов
	               |ГДЕ
	               |	CW_ПредопреленныеФункцииШаблонов.ЭтоГруппа = ЛОЖЬ
	               |	И CW_ПредопреленныеФункцииШаблонов.Предопределенный = ИСТИНА";   
	
	РезультатЗапроса = Запрос.Выполнить();
	
	мКартинки = ПолучитьИменаПредопределенныхКартинок();
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		ФункцияОбъект = Выборка.Ссылка.ПолучитьОбъект(); 
		
		ИдентификаторФункции 	= СокрЛП(Выборка.ИмяПредопределенныхДанных);
		Если мКартинки.Найти(Выборка.Ссылка) <> Неопределено Тогда
			ИдентификаторФункции = СтрЗаменить(ИдентификаторФункции, "НашиРеквизиты_", "");	
		КонецЕсли;
		
		ФункцияОбъект.ИдентификаторФункции  = ИдентификаторФункции;
		ФункцияОбъект.ИмяМетода 			= "CW_ШаблоныДокументовФункции."+СокрЛП(Выборка.ИмяПредопределенныхДанных)+"(ОбъектПечати)";
		
		ФункцияОбъект.ДоступныеНазначенияШаблонов.Очистить();
		
		Если СтрНачинаетсяС(Выборка.ИмяПредопределенныхДанных, "НашиРеквизиты_")
			ИЛИ СтрНачинаетсяС(Выборка.ИмяПредопределенныхДанных, "РеквизитыКонтрагента_") Тогда
			МассивНазначений = ПолучитьМассивыДоговора();
			Для Каждого Назначение из МассивНазначений Цикл
				НоваяСтрока = ФункцияОбъект.ДоступныеНазначенияШаблонов.Добавить();
				НоваяСтрока.НазначениеШаблона = Назначение; 
			КонецЦикла;
			
		КонецЕсли;
		ФункцияОбъект.Записать();  
		
	КонецЦикла;
	
КонецПроцедуры    

Функция ПолучитьИменаПредопределенныхКартинок() Экспорт 
	
	Массив = новый Массив;  
	Массив.Добавить(ПредопределенноеЗначение("Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.НашиРеквизиты_РуководительПодпись"));
	Массив.Добавить(ПредопределенноеЗначение("Справочник.CW_ПредопреленныеФункцииШаблоновДокументов.НашиРеквизиты_ПечатьОрганизации"));
	
	Возврат Массив;
	
КонецФункции

Функция ПолучитьМассивыДоговора()
	
	Массив = Новый Массив;
	Массив.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_ДоговорыПоГрузоперевозкам")));
	Массив.Добавить(ОбщегоНазначения.ИдентификаторОбъектаМетаданных(Тип("СправочникСсылка.CW_ПриложенияКДоговорам")));
	
	Возврат Массив;
	
КонецФункции
